<?php


namespace iAmirNet\SamanTel\SoapMethods;


trait Error
{
    public $errors = [
        "E1" => [
            "fa" => "نام کاربری و یا کلمه عبور وارد نشده است.",
        ],
        "E2" => [
            "fa" => "ورود تمام ی پارامترها الزامیست.",
        ],
        "E3" => [
            "fa" => "پارامتر ورودی بای د از نوع رشته باشد.",
        ],
        "E4" => [
            "fa" => "دسترسی غیر مجاز به سیستم",
        ],
        "E5" => [
            "fa" => "نام کاربری و یا کلمه عبور صحیح نیست.",
        ],
        "E107" => [
            "fa" => "تعداد گیرندگان مشخص شده بیش از 90 گیرنده میباشد.",
        ],
        "E223" => [
            "fa" => "شماره اختصاصی وارد شده نا معتبر است.",
        ],
        "E211" => [
            "fa" => "طول متن پیام بیش از حد مجاز است.",
        ],
        "E6" => [
            "fa" => "اعتبار برای ارسال کافی نیست.",
        ],
        "E7" => [
            "fa" => "پیام ورودی جدید خوانده نشده ای وجود ندارد.",
        ],
        "E8" => [
            "fa" => "شناسه وارد شده پیام جهت دریافت وضعیت نا معتبر است.",
        ],
        "E305" => [
            "fa" => "شناسه وارد شده پیام جهت دریافت وضعیت وجود ندارد.",
        ],
        "E65" => [
            "fa" => "مقداردهی شناسه پیام الزامیست.",
        ],
        "E66" => [
            "fa" => "مقداردهی شماره اختصاصی مورد نظر الزامیست.",
        ],
        "E43" => [
            "fa" => "شماره گیرنده نامعتبر است.",
        ],
        "E766" => [
            "fa" => "متن پیام خالی است.",
        ],
        "E191" => [
            "fa" => "فیلد فلش بجز 2 و 1 وارد شده است.",
        ],
        "E999" => [
            "fa" => "شماره منقضی شده است.",
        ],
        "E998" => [
            "fa" => "پکیج منقضی شده است.",
        ],
        "E303" => [
            "fa" => "هیچ شماره گیرنده صحیحی وارد نشده است.",
        ],
        "E132" => [
            "fa" => "متن وارد شده شامل کلمات حساس است.",
        ],
    ];

    public function getError($num, $def = -1)
    {
        return isset($this->errors[$num]) ? $this->errors[$num][$this->getLang()]: ($def == -1 ? $this->errors["E1"][$this->getLang()] : $def);
    }
}
